var admin = require("firebase-admin");
const { getFirestore } = require('firebase-admin/firestore')
var serviceAccount = require("./serviceAccountKey.json");
 
admin.initializeApp({
  credential: admin.credential.cert(serviceAccount),
  databaseURL: "firebase-adminsdk-2suyt@project-conan-95b4a.iam.gserviceaccount.com"
});
 
var db = getFirestore() ;
 
const movies = [
  {
    "movieId":1,
    "name": "Conan The Movie 01",
    "description": "คุโด้ ชินอิจิในร่างเด็ก หรือ เอโดงาว่า โคนัน ได้รับเชิญไปร่วมงานปาร์ตี้ของนักสถาปนิกชื่อดัง ศาสตราจารย์โมริยะ เทจิ เนื่องจากชินอิจิได้กลายเป็นเด็กไปแล้ว จึงขอร้องให้โมริ รันช่วยไปแทน แต่รันกลับมีข้อแลกเปลี่ยนว่า วันเสาร์ที่ 3 พฤษภาคมนี้ ต้องไปดูหนังเรื่อง ตำนานด้ายแดง วันอังคารที่ 29 เมษายน เอโดงาว่า โคนัน, โมริ รัน, และโมริ โคโกโร่จึงได้ไปที่งานเลี้ยง วันหนึ่งก็มีโทรศัพท์ปริศนาจากชายลึกลับที่ขู่วางระเบิดตามสถานที่ต่างๆโทรมาหาที่หมายเลขโทรศัพท์ที่บ้านของชินอิจิ โคนันได้ไปหยุดการระเบิด และนำระเบิดไปทิ้งได้ จนกระทั่งโทรศัพท์จากชายดังกล่าวก็ได้เข้ามาอีกครั้ง แล้วบอกว่าจะมีการวางระเบิดขบวนรถไฟสายโทโตะ ซึ่งถูกวางระเบิดถึง 5 ลูก โดยระเบิดจะทำงานเมื่อพระอาทิตย์ลับขอบฟ้า แต่โคนันก็สามารถหาที่วางของระเบิดได้ครบ เมื่อโคนันสังเกตได้ว่าการวางระเบิดช่วงนี้เป็นสถานที่ที่ศาสตราจารย์โมริยะ เทจิ เป็นคนออกแบบจึงพบเขาที่บ้าน และก็ได้ค้นพบว่าคนวางระเบิดนั้นก็คือศาสตราจารย์โมริยะ เทจินั่นเอง แต่แล้วระเบิดลูกสุดท้ายที่เขาได้วางไว้คือสถานที่ที่ชินอิจิ และรันนัดดูหนังกัน โคนันจึงรีบไปช่วยรันจากตึกเบกะซิตี้ เนื่องจากประตูทางเข้าล็อบบี้พังจึงไปช่วยรันไม่ได้ โคนันจึงบอกให้รันเป็นคนปลดระเบิดเอง และแล้วรันก็ปลดระเบิดจะสำเร็จแล้ว แต่ก็เหลือสายไฟคู่สุดท้าย สีแดง และสีน้ำเงิน แต่รันก็เลือกตัดสายไฟสีน้ำเงิน ซึ่งไม่เข้าทางของศาสตราจารย์โมริยะ เทจิ ทำให้รันและคนที่ติดในห้องล็อบบี้ปลอดภัย",
    "stars":7.5,
    "category": ["drama", "romance"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie1.jpg?alt=media&token=52aac7e8-44ae-4dc6-86a9-a68e49f5c319",
    "release_date": new Date("1997-04-19T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri", "Conan Edogawa"],
    "totalCharacter": 3,
    "view": 3029540
  },
  {
    "movieId":2,
    "name": "Conan The Movie 02",
    "description": "เกิดเหตุมือลึกลับคอยลอบทำร้ายบุคคลต่างๆอย่างต่อเนื่อง ตั้งแต่ สารวัตรเมงูเระ จูโซที่ถูกลูกธนูหน้าไม้ยิง ขณะที่วิ่งออกกำลังกาย, คิซากิ เอริ ทนายความ แม่ของรันถูกวางยาพิษในช็อกโกแลต และดร.อากาสะ ฮิโรชิ ที่ถูกหน้าไม้ยิงขณะที่เปิดประตูบ้าน โดยที่แต่ละคนจะมีชื่อที่เกี่ยวข้องกับสัญลักษณ์หรือจำนวนบนไพ่ และยังเป็นบุคคลที่มีความเกี่ยวข้องกับ โมริ โคโกโร่ ด้วย ผู้ที่ถูกสงสัยมากที่สุดคือ มุราคามิ โจ อดีตนักพนันที่เพิ่งออกจากคุกซึ่งมีความแค้นกับโคโกโร่ ในเหตุการณ์ๆหนึ่ง อันเป็นเหตุการณ์ที่ทำให้รันคิดว่าเป็นสาเหตุให้โคโกโร่ และเอริ ต้องแยกทางกัน แต่ทว่าบุคคลที่เกี่ยวข้องกับโคโกโร่ที่มีชื่อเป็นจำนวนตัวเลขก็ยังตกเป็นเป้าหมายในการลอบทำร้ายต่อไปคือสึจิ ฮิโรกิ แต่เส้นยาแดงผ่าแปด สึจิ ฮิโรกิรอดชีวิต แต่ก็ต้องพลาดโอกาสการแข่งขันอเมริกันโอเพนไป โคโกโร่นึกชื่อบุคคลต่อไปที่น่าจะมีเลขประกอบนั่นคือ สึจิ ฮิโรกิ พวกเขาจึงพากันไปคุ้มครองและได้ไปที่อะควาเรียมคริสตัล ของคุณอาซาฮี คาสึโยชิ และเจอบุคคลอีกกลุ่มหนึ่งประกอบด้วย นิชินะ มิโนรุ ,ปีเตอร์ ฟอร์ด ,ชิชิโด เอเม ,โอสะนาอิ นานะและซาวากิ โคเฮ ซึ่งชื่อของทุกคนมีตัวเลขเป็นตัวประกอบทั้งสิ้น แต่แล้วสถานที่แห่งนี้ก็กลายเป็นกับดักกลางทะเลที่คนร้ายวางแผนไว้ และก็เกิดการฆาตกรรมขึ้นโดยโอสะนาอิ นานะ ถูกแทง และอาซาฮี คาสึโยชิด้วย พวกโคนันจึงต้องสืบเรื่องราวพร้อมๆกับหาทางหนีออกจากอะควาเรียมคริสตัล จนกระทั่งโคนันพบตัวคนร้ายนั่นคือ ซาวากิ โคเฮ หลังจากคนร้ายจนมุมจึงจับรันเป็นตัวประกัน แต่แล้วโคนันก็ได้ยิงที่ขาของรันเพื่อช่วยชีวิตรันไว้ แล้ว ซาวากิ โคเฮ ก็ถูกจับ",
    "stars": 5.5,
    "category": ["drama", "horror","funny"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie2.jpg?alt=media&token=871d1966-43ef-4623-a1ad-fcfbf45d09ea",
    "release_date": new Date("1998-04-18T00:00:00Z"),
    "charaters": [ "Shinichi Kudo", "Conan Edogawa"],
    "totalCharacter": 2,
    "view": 2009856
  },
  {
    "movieId":3,
    "name": "Conan The Movie 03",
    "description": "เอโดงาว่า โคนัน, โมริ รัน, และโมริ โคโกโร่ ได้รับเชิญจาก รายชื่อตัวละครในยอดนักสืบจิ๋วโคนัน สึสึกิ ชิโร่ ให้มาที่เมืองโอซาก้า เพื่อช่วยปกป้องอิมพีเรียล อีสเตอร์ เอ้ก ไข่ที่กษัตริย์รัสเซียสั่งให้ทำขึ้นเพื่อเป็นของขวัญแก่พระราชินี โดยเป็นใบที่ 51 หรือ เม็มโมรี่ เอ้ก ให้พ้นจากการขโมยของ จอมโจรคิด โดยได้รับความช่วยเหลือจาก นากาโมริ กินโซ, ฮัตโตริ เฮย์จิ, และตำรวจโอซาก้า แต่ถึงกระนั้น ด้วยแผนการอันชาญฉลาดของจอมโจรคิดและการคาดคะเนเวลาปรากฏตัวของจอมโจรคิดผิดพลาด เม็มโมรี่ เอ้กจึงตกอยู่ในมือของจอมโจรคิด แต่ในตอนที่จอมโจรคิดกำลังใช้เครื่องร่อนบินหนี ก็โดนบุคคลนิรนามยิงเข้าที่ตาขวาแต่โชคดีที่มีกระจกกันเอาไว้ ทำให้โคนันซึ่งตามจอมโจรคิดมาสามารถที่จะเก็บรักษาเม็มโมรี่ เอ้กไว้ได้ วันต่อมา เม็มโมรี่ เอ้กจึงถูกส่งกลับโตเกียวด้วยเรือของตระกูลสึสึกิเพื่อตรวจดูความเสียหาย",
    "stars": 10,
    "category": ["thriller", "scare","horror"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie3.jpg?alt=media&token=2b6e9559-3e53-4b04-a5fa-317ed8b88a6e",
    "release_date": new Date("2023-12-18T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri", "Conan Edogawa"],
    "totalCharacter": 3,
    "view": 5236841
  },
  {
    "movieId":4,
    "name": "Conan The Movie 04",
    "description": "คดีฆาตกรรมต่อเนื่องที่ชีวิตนายตำรวจมากมายใช้เป็นเครื่องสังเวย และชะตากรรมของ โมริ รัน ก็กำลังไปสู่ความน่ากลัวนั้น 'NEED NOT TO KNOW...ไม่จำเป็นต้องรู้' ในงานอวยพรการแต่งงานของน้องสาวสารวัตรชิราโทริ ได้เกิดการลอบสังหารหมวดซาโต้ขึ้นต่อหน้ารัน ทำให้รันช็อคและความจำเสื่อม คนร้ายรู้ว่ารันเห็นหน้าเขาจึงต้องฆ่าปิดปาก โคนันจึงเข้ามาช่วยฟื้นความจำรัน และปกป้องรันจากเงื้อมมือฆาตกร",
    "stars": 4.2,
    "category": ["fun", "scare"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie4.jpg?alt=media&token=aecd086e-0f27-446a-830d-5bd2df961ebb",
    "release_date": new Date("2000-04-22T00:00:00Z"),
    "charaters":  ["Shuichi Akai","Shinichi Kudo","Ran Mouri", "Conan Edogawa"],
    "totalCharacter": 4,
    "view": 3648521
  },
  {
    "movieId":5,
    "name": "Conan The Movie 05",
    "description": "เป็นตอนพิเศษของภาพยนตร์การ์ตูนเรื่องยอดนักสืบจิ๋ว โคนัน ตอนที่ 5 ในประเทศไทยออกอากาศทางฟรีทีวีทางโมเดิร์นไนน์ ทีวี ในวันหยุดนักขัตฤกษ์ 3 ครั้ง ในวันที่ 6 เมษายน พ.ศ. 2547 เวลา 08.00-10.00 น. และวันที่ 21 กรกฎาคม พ.ศ. 2548 เวลา 08.00-10.00 น.และวันที่ 6-7 กรกฎาคม พ.ศ. 2562 เวลา 07.00-08.00 ทางช่อง True 4u",
    "stars": 8,
    "category":["drama", "fun"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie5.jpg?alt=media&token=2d01a3f4-cbdd-47e7-8638-936339e33389",
    "release_date": new Date("2001-04-21T00:00:00Z"),
    "charaters": [  "Conan Edogawa","Shinichi Kudo","Ran Mouri","Amuro Toru"],
    "totalCharacter": 4,
    "view": 3698651
  },
  {
    "movieId":6,
    "name": "Conan The Movie 06",
    "description": "ฮิโรกิ ซาวาดะ (Hiroki Sawada) เป็นเด็กอัจฉริยะวัยสิบปี แม้อายุยังน้อย แต่เขาก็เป็นนักศึกษาสถาบันเทคโนโลยีแมตซาชูเซตส์แล้ว และเนื่องจากมารดาเสียชีวิต เขาจึงมีโทมัส ชินด์เลอร์ (Thomas Schindler) ประธานบริษัทชินด์เลอร์ เป็นผู้ปกครอง แต่นายชินด์เลอร์นั้นให้เขาอาศัยอยู่บนยอดอาคารชินด์เลอร์แล้ววางเวรยามรายรอบ เพื่อให้เขาคอยสร้างซอฟต์แวร์ให้แก่บริษัทเรื่อยไป ซึ่งฮิโรกิก็ได้พัฒนาซอฟอต์แวร์ติดตามดีเอ็นเอขึ้นซอฟต์แวร์หนึ่ง ต่อมาคืนหนึ่ง ฮิโรกิสร้างสมองกลชื่อ 'เรือโนอาห์' ขึ้นเป็นผลสำเร็จ แล้วส่งสมองกลนั้นไปตามสายโทรศัพท์ ก่อนจะปลิดชีวิตตนเองโดยโจนจากหน้าต่างอาคารลงสู่ท้องน้ำเบื้องล่างถึงแก่ความตายสองปีให้หลัง บริษัทชินด์เลอร์จัดนิทรรศการเกมเสมือนจริงชื่อ 'โคคูน' (Cocoon) ที่ศาลาว่าการเมืองเบกะ กลุ่มนักสืบโมริและโคนันได้รับเชิญมาด้วย แต่ไม่อาจร่วมงานเพราะไม่มีเข็มกลัดประจำงาน ขณะนั้น ดอกเตอร์อากาสะ กับยูซากุ คุโด้ มาถึงศาลาว่าการเมือง ดอกเตอร์อากาสะจึงมอบเข็มกลัดให้แก่โคนัน ส่วนสมาชิกคนอื่น ๆ ของชมรมนักสืบเยาวชนแลกเข็มกลัดกับการ์ดหน้ากากไยบะรุ่นพิเศษ และสามารถเข้านิทรรศการกันได้ทั้งหมด",
    "stars":7.5,
    "category": ["drama", "rating"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie6.jpg?alt=media&token=086b7652-a392-42b1-8d2b-5b552cab4dec",
    "release_date": new Date("2002-04-20T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri", "Conan Edogawa"],
    "totalCharacter": 3,
    "view": 3029540
  },
  {
    "movieId":7,
    "name": "Conan The Movie 07",
    "description": "เกิดคดีฆาตกรรมต่อเนื่องซึ่งผู้ตายทั้งหมดมีหนังสือ กิเคคิ ไว้ครอบครอง หนึ่งฆาตกรในกลุ่มโจรได้ขโมยพระเก็นจิโบตารุทิ้งปริศนาเพื่อใช้ค้นหาพระพุทธรูปซึ่งหายไปเมื่อหลายปีก่อน ทำให้โคนันต้องมาคลี่คลายคดีนี้ขณะที่ ฮัตโตริ นักสืบโอซาก้า ก็มาร่วมงานด้วยเพราะต้องการที่จะมาหาหญิงสาวที่เป็นที่รักแรกฮัตโตริคิดว่าเธอคือเจ้าของอัญมณีสีขาวที่เป็นเป้าหมายของฆาตกร",
    "stars":7.5,
    "category": ["drama", "rating"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie7.jpg?alt=media&token=9594d4aa-27d7-4532-aff4-2a6aaa1b526b",
    "release_date": new Date("2003-04-15T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri"],
    "totalCharacter": 2,
    "view": 3029540
  },
  {
    "movieId":8,
    "name": "Conan The Movie 08",
    "description": "เป็นตอนพิเศษของภาพยนตร์เรื่องยอดนักสืบจิ๋ว โคนัน ตอนที่ 8 ออกฉายในประเทศไทยในวันที่ 3 ธันวาคม พ.ศ. 2548 ที่โรงภาพยนตร์เมเจอร์ซีนีเพล็กซ์ รัชโยธิน[1] และออกอากาศทางฟรีทีวีทางสถานีโทรทัศน์สีกองทัพบกช่อง 7 ในช่วงหนังรอบเช้าวันหยุด วันที่ 6 ธันวาคม พ.ศ. 2553 เวลา 08.00-10.00 น.[2]",
    "stars":7.5,
    "category": ["drama", "rating"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie8.jpg?alt=media&token=27fa100c-053a-4090-8450-4c7a67ebdca4",
    "release_date": new Date("2004-04-17T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri", "Conan Edogawa"],
    "totalCharacter": 3,
    "view": 3029540
  },
  {
    "movieId":9,
    "name": "Conan The Movie 09",
    "description": "เป็นภาพยนตร์ลำดับที่ 9 ของยอดนักสืบจิ๋วโคนันเดอะมูฟวี่ ทำรายได้ 2.15 พันล้านเยน[1]",
    "stars":7.5,
    "category": ["drama", "rating"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie9.jpg?alt=media&token=14506947-60b2-4250-821d-15dd0f969288",
    "release_date": new Date("2005-04-09T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri" ,"Conan Edogawa"],
    "totalCharacter": 3,
    "view": 3029540
  },
  {
    "movieId":10,
    "name": "Conan The Movie 10",
    "description": " เป็นภาพยนตร์ลำดับที่ 10 ของยอดนักสืบจิ๋วโคนัน ออกฉายในประเทศญี่ปุ่นเมื่อวันที่ 15 เมษายน พ.ศ. 2549 ทำรายได้ 3.03 พันล้านเยน สำหรับในประเทศไทย ออกฉายเมื่อวันที่ 3 ธันวาคม พ.ศ. 2549 ที่โรงภาพยนตร์เซ็นจูรี",
    "stars":7.5,
    "category": ["drama", "rating"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie10.jpg?alt=media&token=e0e963aa-086c-4b6e-abd0-e68bf8dd970e",
    "release_date": new Date("2006-04-15T00:00:00Z"),
    "charaters": ["Shinichi Kudo", "Conan Edogawa","Ran Mouri"],
    "totalCharacter": 3,
    "view": 3029540
  },
  {
    "movieId":11,
    "name": "Conan The Movie 11",
    "description": "เป็นภาพยนตร์ยอดนักสืบจิ๋วโคนันลำดับที่ 11 ซึ่งเป็นเรื่องราวเกี่ยวกับโจรสลัดสาวสองคน คือ แอน โบนี และ แมรี รีด ได้ฝังสมบัติไว้ที่เกาะแห่งหนึ่งในมหาสมุทรแปซิฟิกเมื่อ 300 ปีก่อน โดยภาพยนตร์เรื่องนี้ออกฉายในประเทศญี่ปุ่นเมื่อวันที่ 21 เมษายน พ.ศ. 2550 ทำรายได้ 2.53 พันล้านเยน ส่วนในประเทศไทย ฉายที่โรงภาพยนตร์เซ็นจูรีเมื่อวันที่ 22 ธันวาคม พ.ศ. 2550",
    "stars":7.5,
    "category": ["drama", "rating"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie11.jpg?alt=media&token=cf23c456-0bd2-453f-83f1-31652b107fb9",
    "release_date": new Date("2007-04-21T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri", "Conan Edogawa"],
    "totalCharacter": 3,
    "view": 3029540
  },
  {
    "movieId":12,
    "name": "Conan The Movie 12",
    "description": "เหตุการณ์ในตอนนี้เริ่มขึ้นที่คดีฆาตกรรมต่อเนื่องที่จ้องเล่นงานเฉพาะนักดนตรี และเหยื่อเคราะห์ร้ายในคดีนี้ก็ล้วนแต่เคยเรียนในสถาบันดนตรีของอดีตนักเปียโนชื่อดังคนหนึ่งทั้งนั้น ระหว่างนั้นพวกโคนันได้รับเชิญไปในงานคอนเสิร์ตเปิดมิวสิคฮอลล์ ซึ่งสร้างขึ้นโดยนักเปียโนคนนั้น จุดเด่นของงานคอนเสิร์ตครั้งนี้ก็คือ 'ไปป์ออร์แกน' ที่มีประวัติอันยาวนาน, ไวโอลิน 'สตราดิวาเรียส' ที่มีชื่อเสียงระดับโลก และเสียงของนักร้องโอเปราผู้มีพรสวรรค์ แต่เบื้องหลังงานคอนเสิร์ตนี้ดูมีเรื่องเคลือบแคลงน่าสงสัยหลายอย่าง เมื่อถึงวันงานจู่ๆก็เกิดเหตุระเบิดขึ้นอย่างไม่คาดฝัน มุมหนึ่งของมิวสิกฮอลล์กลายเป็นทะเลเพลิงไปในพริบตา นักร้องนำอากิบะ เรย์โกะถูกปองร้าย และนำไปสู่อันตรายที่เกิดขึ้นกับโคนัน",
    "stars":7.5,
    "category": ["drama", "rating"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie12.jpg?alt=media&token=c404ab20-8214-4413-85ce-7f2fcb0dcb5b",
    "release_date": new Date("2008-04-19T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri"],
    "totalCharacter": 2,
    "view": 3029540
  },
  {
    "movieId":13,
    "name": "Conan The Movie 13",
    "description": " เป็นภาพยนตร์ลำดับที่ 13 ของยอดนักสืบจิ๋วโคนัน เข้าฉายที่ประเทศญี่ปุ่นเมื่อวันที่ 18 เมษายน พ.ศ. 2552 โดยก่อนหน้านั้นมีการฉายรอบปฐมทัศน์ทางแอนิแมกซ์[3] ภาพยนตร์ทำรายได้ในประเทศทั้งสิ้น 3.9 พันล้านเยน ทำให้กลายเป็นภาพยนตร์ยอดนักสืบจิ๋วโคนันที่ทำรายได้สูงที่สุดในขณะนั้น[4] ส่วนในประเทศไทย ภาพยนตร์เข้าฉายเมื่อวันที่ 12 ธันวาคม พ.ศ. 2552[5] ภาพยนตร์นี้เป็นภาคที่สองของยอดนักสืบจิ๋วโคนันที่มีเนื้อหาเกี่ยวกับองค์กรชุดดำ[1] ต่อจากคดีปริศนาเส้นตายสู่สวรรค์ มีเนื้อเรื่องเกี่ยวกับ สมาชิกองค์กรชุดดำคนใหม่ที่ทราบว่า คุโด้ ชินอิจิ ได้รับยา APTX4869 จนร่างกายหดเล็กลงกลายเป็นโคนัน การสืบค้นครั้งทำให้เกิดเหตุการณ์อันตรายจากองค์กรชุดดำตามมา ภาพยนตร์นี้ได้รับการเสนอชื่อเข้าชิงรางวัลเจแปนอะคาเดมีประจำปี 2553[6]",
    "stars":7.5,
    "category": ["drama", "rating"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie13.jpg?alt=media&token=84b4e591-126e-42e7-9ae0-7d2e7d2cd191",
    "release_date": new Date("2009-04-18T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri", "Conan Edogawa"],
    "totalCharacter": 3,
    "view": 3029540
  },
  {
    "movieId":14,
    "name": "Conan The Movie 14",
    "description": "เป็นภาพยนตร์ยอดนักสืบจิ๋วโคนันลำดับที่ 14 ออกฉายครั้งแรกในญี่ปุ่นเมื่อวันที่ 17 เมษายน ค.ศ. 2010 ภาพยนตร์เรื่องนี้มีการปรากฏตัวของจอมโจรคิด หลังจากที่เขาปรากฏตัวครั้งล่าสุดใน บทเพลงมรณะแด่เหล่านักสืบ[1][3] ภาพยนตร์ทำรายได้ในประเทศทั้งสิ้น 3.1 พันล้านเยน[2] และได้ออกอากาศซ้ำทางช่องเอ็นเอ็นเอสเมื่อวันที่ 15 เมษายน ค.ศ. 2011 เพื่อเป็นการฉลองครบรอบ 15 ปีของอนิเมะเรื่องนี้ และได้ออกอากาศซ้ำอีกครั้งในวันที่ 17 สิงหาคม ค.ศ. 2012 สำหรับในประเทศไทย ภาพยนตร์เข้าฉายเมื่อวันที่ 11 ธันวาคม ค.ศ. 2010",
    "stars":7.5,
    "category": ["drama", "rating"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie14.jpg?alt=media&token=ef39a0d1-b481-4bcc-9eba-730b62192a46",
    "release_date": new Date("2010-04-18T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri"],
    "totalCharacter": 2,
    "view": 3029540
  },
  {
    "movieId":15,
    "name": "Conan The Movie 15",
    "description": "เป็นภาพยนตร์เรื่องที่ 15 ในชุดมังงะและอนิเมะ ยอดนักสืบจิ๋วโคนัน มีกำหนดเข้าฉายวันแรกวันที่ 16 เมษายน พ.ศ. 2554 และ ภาคนี้ได้กำหนดเข้าฉายในประเทศไทยในวันที่ 3 ธันวาคม 2554[2] รายละเอียดของภาพยนตร์ได้รับการเปิดเผยทางเว็บไซต์อย่างเป็นทางการเมื่อวันที่ 4 ธันวาคม พ.ศ. 2553 [2][3]",
    "stars":7.5,
    "category": ["drama", "rating"],
    "picture": "https://firebasestorage.googleapis.com/v0/b/project-conan-95b4a.appspot.com/o/movie15.jpg?alt=media&token=b5f2bdba-58c1-4eb7-a8f8-2fca0f8a2cfd",
    "release_date": new Date("2011-04-16T00:00:00Z"),
    "charaters": ["Shinichi Kudo","Ran Mouri", "Conan Edogawa"],
    "totalCharacter": 3,
    "view": 3029540
  }
]
 
movies.forEach(async function(obj){
    await db.collection("movies").doc(obj.movieId.toString()).set(obj).then(async docRef => {
      console.log(docRef.movieId+","+docRef.picture)
     })
  });
